package com.xiaomi.nlp.classification.spamsms;

import com.xiaomi.nlp.classification.spamsms.smsspam.Corpus;
import com.xiaomi.nlp.classification.spamsms.smsspam.algBatch.MultiBayesTest;
import com.xiaomi.nlp.classification.spamsms.smsspam.preprocess.RuleManager;

import java.io.IOException;

/**
 * Created by dy on 15-8-6.
 */
public class Test {
    public static void main(String[] args) throws IOException{

        MultiBayesTest mbs = new MultiBayesTest();
        //Corpus cps = new Corpus("sender", "尊敬的爱眼眼镜新老顾客：爱眼眼镜北关店已搬迁至朔州老城内，欢迎前来选购。地址：烟草公司斜对面/劳动局南50米（原来北街）  电话：20333\uFFFF\uFFFF\n");
        Corpus cps = new Corpus("sender", " 【4G】：\n" +
                "基站退服0处,\n" +
                "小区退服66处(丰城市 4BFCXH丰城泉港高速专网2   2015-08-06 15:58:44,丰城市 5AFCCX丰城物华路旁分布式1   2015-08-06 20:03:34,丰城市 5AFCCX丰城物华路旁分布式2   2015-08-06 20:03:34,丰城市 5AFCCX丰城物华路旁分布式3   2015-08-06 20:03:34,丰城市 4CFCXX丰城同田肖家分布式2   2015-08-07 16:06:38,丰城市 5AFCNX丰城石滩园艺场专网分布式1   2015-08-07 16:16:49,丰城市 5AFCNX丰城石滩园艺场专网分布式2   2015-08-07 16:16:49,丰城市 4CFCXX丰城同田肖家分布式1   2015-08-07 16:34:58,丰城市 4CFCXX丰城同田肖家分布式3   2015-08-07 16:34:58,丰城市 3DFCCX丰城小桥丰家1   2015-08-08 20:03:31,丰城市 4CFCCX丰城新法院分布式1   2015-08-08 20:04:50,丰城市 4CFCCX丰城新法院分布式2   2015-08-08 20:04:50,丰城市 4CFCCX丰城新法院分布式3   2015-08-08 20:04:50,丰城市 5AFCNX丰城董家镇京山村云程分布式1   2015-08-09 07:30:05,丰城市 5AFCNX丰城董家镇京山村云程分布式2   2015-08-09 07:30:05,丰城市 5AFCNX丰城董家镇京山村云程分布式3   2015-08-09 07:30:05,丰城市 5AFCCX丰城府前路福泽上城小区分布式2   2015-08-09 08:08:14,丰城市 5AFCCX丰城府前路福泽上城小区分布式1   2015-08-09 08:27:02,丰城市 5AFCXX丰城上塘政府1   2015-08-09 10:42:41,丰城市 5AFCXX丰城上塘政府2   2015-08-09 10:42:41,丰城市 5AFCCX丰城剑桥路剑南街道杜家分布式3   2015-08-09 13:34:11,丰城市 5AFCNX丰城白土渣溪桥分布式1   2015-08-09 19:41:21,丰城市 5AFCCX丰城府前路福泽上城小区分布式3   2015-08-09 20:10:10,丰城市 5AFCNX丰城蕉坑石桥1   2015-08-10 01:35:40,丰城市 4BFCCI丰城恒丰时代广场B座高层室分1   2015-08-10 02:46:24,丰城市 4BFCCI丰城恒丰时代广场A座低层室分2   2015-08-10 02:46:36,丰城市 5AFCNX丰城小港镇沙埂村吊上尾分布式1   2015-08-10 06:10:37,丰城市 5AFCNX丰城小港镇沙埂村吊上尾分布式2   2015-08-10 06:10:37,丰城市 5AFCNX丰城小港镇沙埂村吊上尾分布式3   2015-08-10 06:10:37,奉新县 5AFXNH奉新港口洪城分布式1   2015-08-09 06:50:58,奉新县 5AFXNH奉新港口洪城分布式2   2015-08-09 06:50:58,奉新县 4BFXCX奉新路口坳下分布式2   2015-08-10 03:25:46,高安市 3CGACX高安丁家路1   2015-08-09 17:03:44,高安市 3CGACX高安丁家路2   2015-08-09 17:03:44,高安市 3CGACX高安丁家路3   2015-08-09 17:03:44,高安市 4CGACI高安福康彩虹城小区室分1   2015-08-10 05:35:40,上高县 5ASGCX上高锦江大桥分布式1   2015-08-10 00:44:37,上高县 5ASGCX上高锦江大桥分布式2   2015-08-10 00:44:37,上高县 5ASGCX上高锦江大桥分布式3   2015-08-10 00:44:37,上高县 5ASGNX上高汗堂石溪分布式1   2015-08-10 01:15:00,万载县 5AWZNX万载双桥上庄1   2015-08-09 19:31:29,万载县 5AWZNX万载双桥上庄2   2015-08-09 19:31:29,万载县 4BWZCX万载金峰分布式1   2015-08-10 04:42:43,万载县 4BWZCX万载金峰分布式2   2015-08-10 04:42:43,万载县 4BWZCX万载金峰分布式3   2015-08-10 04:42:43,宜丰县 4BYFXX宜丰金岭国际分布式1   2015-08-06 19:24:43,宜丰县 4BYFXX宜丰金岭国际分布式2   2015-08-06 19:24:43,宜丰县 4BYFXX宜丰金岭国际分布式3   2015-08-06 19:24:43,宜丰县 5AYFNH宜丰潭山九岭山隧道分布式2   2015-08-08 10:33:25,袁州区 5AYCNX宜春西村社台分布式1   2015-08-07 03:26:17,袁州区 5AYCNX宜春西村社台分布式2   2015-08-07 03:26:17,袁州区 5AYCNX宜春西村社台分布式3   2015-08-07 03:26:17,袁州区 5AYCNH宜春环城南路袁河农庄分布式2   2015-08-07 04:45:19,袁州区 5AYCNH宜春环城南路袁河农庄分布式3   2015-08-07 04:45:19,袁州区 5AYCNH宜春环城南路袁河农庄分布式1   2015-08-07 04:54:55,袁州区 5AYCCX宜春环城西路宋公馆别墅区内分布式2   2015-08-07 05:03:09,袁州区 5AYCCX宜春环城西路宋公馆别墅区内分布式3   2015-08-07 05:08:21,袁州区 5AYCCX宜春环城西路宋公馆别墅区内分布式1   2015-08-07 05:08:42,袁州区 4BYCCI宜春朝阳路腾达电器2部室分1   2015-08-09 20:41:38,袁州区 5AYCCI宜春东风路加贝超市B1商业区室分2   2015-08-09 20:50:39,樟树市 4CZSCX樟树东方巴黎分布式1   2015-08-09 01:11:41,樟树市 4CZSCX樟树东方巴黎分布式2   2015-08-09 01:11:41,樟树市 5AZSCX樟树药材城荣欣投资有限公司分布式1   2015-08-10 06:13:20,樟树市 5AZSCX樟树药材城荣欣投资有限公司分布式2   2015-08-10 06:13:20,樟树市 5AZSCX樟树药材城荣欣投资有限公司分布式3   2015-08-10 06:13:20,樟树市 4CZSCI樟树恒鑫华府室分1   2015-08-10 06:13:28)\n" +
                " 【WLAN】：\n" +
                "退服AP0个 【集客专线】：\n" +
                "未恢复集客专线故障0起 【停电机房及传输节点】：\n" +
                "2个传输节点停电(铜鼓县 宜春铜鼓县大段传输主机房,万载县 宜春万载县三兴传输主机房),0个机房停电\n" +
                " 【停电基站】：\n" +
                "163个停电基站(丰城市: 32个,奉新县: 2个,高安市: 9个,靖安县: 4个,上高县: 8个,铜鼓县: 9个,万载县: 20个,宜丰县: 11个,袁州区: 46个,樟树市: 22个)");
        RuleManager ruleManager = new RuleManager();
        ruleManager.preprocess(cps);
        boolean clf = mbs.classify(cps, null);
        System.out.println(clf);
    }
}
